In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns

In [ ]:
import warnings
warnings.filterwarnings('ignore')

# Q1

## a

In [ ]:
iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
iris.groupby('species').agg(['mean', 'std'])

           sepal_length           sepal_width  ... petal_length petal_width
                   mean       std        mean  ...          std        mean       std
species                                        ...
setosa            5.006  0.352490       3.428  ...     0.173664       0.246  0.105386
versicolor        5.936  0.516171       2.770  ...     0.469911       1.326  0.197753
virginica         6.588  0.635880       2.974  ...     0.551895       2.026  0.274650

[3 rows x 8 columns]

In [ ]:
iris.groupby('species').describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

## b

In [ ]:
s = iris[iris.species=='setosa']['sepal_length']

In [ ]:
lower = q1 - 1.5 * iqr
upper = q3 + 1.5 * iqr
s[(s < lower) | (s > upper)] = np.nan
s.isnull().sum()

0

In [ ]:
def get_new_stat(s):
  q1, q3 = s.quantile(.25), s.quantile(.75)
  iqr = q3 - q1
  lower = q1 - 1.5 * iqr
  upper = q3 + 1.5 * iqr
  s[(s < lower) | (s > upper)] = np.nan
  outlier = s.isnull().sum() != 0
  return outlier, np.round(s.mean(),2), np.round(s.std(), 4)

In [ ]:
species_list, feature_list, mean_list, std_list = [], [], [], []
outlier_list, new_mean_list, new_std_list = [], [], []
for species in iris.species.unique():
  for feature in iris.columns[:-1]:
    s = iris[iris.species == species][feature]
    species_list.append(species)
    feature_list.append(feature)
    mean_list.append(np.round(s.mean(),2))
    std_list.append(np.round(s.std(), 4))

    outlier, new_mean, new_std = get_new_stat(s)
    outlier_list.append(outlier)
    new_mean_list.append(new_mean)
    new_std_list.append(new_std)

In [ ]:
df = pd.DataFrame({
    'species':  species_list,
    'feature':  feature_list,
    'mean'   :  mean_list,
    'std'    :  std_list,
    'outlier':  outlier_list,
    'new_mean': new_mean_list,
    'new_std':  new_std_list
})
df.set_index(['species', 'feature'], inplace=True)
df

                         mean     std  outlier  new_mean  new_std
species    feature
setosa     sepal_length  5.01  0.3525    False      5.01   0.3525
           sepal_width   3.43  0.3791     True      3.43   0.3203
           petal_length  1.46  0.1737     True      1.46   0.1291
           petal_width   0.25  0.1054     True      0.23   0.0859
versicolor sepal_length  5.94  0.5162    False      5.94   0.5162
           sepal_width   2.77  0.3138    False      2.77   0.3138
           petal_length  4.26  0.4699     True      4.29   0.4378
           petal_width   1.33  0.1978    False      1.33   0.1978
virginica  sepal_length  6.59  0.6359     True      6.62   0.5935
           sepal_width   2.97  0.3225     True      2.96   0.2603
           petal_length  5.55  0.5519    False      5.55   0.5519
           petal_width   2.03  0.2747    False      2.03   0.2747

# Q2

## a

In [ ]:
titanic = sns.load_dataset('titanic')
titanic

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [ ]:
titanic['category1'] = titanic.apply(lambda r: r.sex if r.age >= 20.0 else 'child', axis=1)
titanic

     survived  pclass     sex   age  ...  embark_town  alive  alone category1
0           0       3    male  22.0  ...  Southampton     no  False      male
1           1       1  female  38.0  ...    Cherbourg    yes  False    female
2           1       3  female  26.0  ...  Southampton    yes   True    female
3           1       1  female  35.0  ...  Southampton    yes  False    female
4           0       3    male  35.0  ...  Southampton     no   True      male
..        ...     ...     ...   ...  ...          ...    ...    ...       ...
886         0       2    male  27.0  ...  Southampton     no   True      male
887         1       1  female  19.0  ...  Southampton    yes   True     child
888         0       3  female   NaN  ...  Southampton     no  False     child
889         1       1    male  26.0  ...    Cherbourg    yes   True      male
890         0       3    male  32.0  ...   Queenstown     no   True      male

[891 rows x 16 columns]

## b

In [ ]:
# fillna() 한 것을 titanic.age에 넣어줘야 한다.
titanic.age = titanic.age.fillna(titanic.age.mean())
titanic.tail()

# 위의 경우 age 29인데, child로 category1 되므로 위의 코드 다시 반복

     survived  pclass     sex        age  ...  embark_town  alive  alone category1
886         0       2    male  27.000000  ...  Southampton     no   True      male
887         1       1  female  19.000000  ...  Southampton    yes   True     child
888         0       3  female  29.699118  ...  Southampton     no  False     child
889         1       1    male  26.000000  ...    Cherbourg    yes   True      male
890         0       3    male  32.000000  ...   Queenstown     no   True      male

[5 rows x 16 columns]

In [ ]:
titanic['category1'] = titanic.apply(lambda r: r.sex if r.age >= 20.0 else 'child', axis=1)
titanic

     survived  pclass     sex        age  ...  embark_town  alive  alone category1
0           0       3    male  22.000000  ...  Southampton     no  False      male
1           1       1  female  38.000000  ...    Cherbourg    yes  False    female
2           1       3  female  26.000000  ...  Southampton    yes   True    female
3           1       1  female  35.000000  ...  Southampton    yes  False    female
4           0       3    male  35.000000  ...  Southampton     no   True      male
..        ...     ...     ...        ...  ...          ...    ...    ...       ...
886         0       2    male  27.000000  ...  Southampton     no   True      male
887         1       1  female  19.000000  ...  Southampton    yes   True     child
888         0       3  female  29.699118  ...  Southampton     no  False    female
889         1       1    male  26.000000  ...    Cherbourg    yes   True      male
890         0       3    male  32.000000  ...   Queenstown     no   True      male

[891 rows x 16 columns]

## c

In [ ]:
# 'alive' : category, 'survived' : int
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [ ]:
titanic.pivot_table('survived', 'class')

        survived
class
First   0.629630
Second  0.472826
Third   0.242363

In [ ]:
titanic.groupby('embark_town')[['survived']].mean()

             survived
embark_town
Cherbourg    0.553571
Queenstown   0.389610
Southampton  0.336957

In [ ]:
titanic.pivot_table('survived', ['sex', 'class'])

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [ ]:
 titanic.pivot_table('survived', ['sex', 'class'], 'embark_town')

embark_town    Cherbourg  Queenstown  Southampton
sex    class
female First    0.976744    1.000000     0.958333
       Second   1.000000    1.000000     0.910448
       Third    0.652174    0.727273     0.375000
male   First    0.404762    0.000000     0.354430
       Second   0.200000    0.000000     0.154639
       Third    0.232558    0.076923     0.128302

## d

In [ ]:
bins    = [1, 20, 30, 50, 70, 100]
labels  = ['미성년자', '청년', '중년', '장년', '노년']
titanic['age_cat'] = pd.cut(titanic.age, bins=bins, labels=labels)
titanic.tail()

     survived  pclass     sex        age  ...  alive  alone  category1 age_cat
886         0       2    male  27.000000  ...     no   True       male      청년
887         1       1  female  19.000000  ...    yes   True      child    미성년자
888         0       3  female  29.699118  ...     no  False     female      청년
889         1       1    male  26.000000  ...    yes   True       male      청년
890         0       3    male  32.000000  ...     no   True       male      중년

[5 rows x 17 columns]

In [ ]:
titanic.pivot_table('survived', 'age_cat')

         survived
age_cat
미성년자     0.424242
청년       0.334152
중년       0.423237
장년       0.355932
노년       0.200000

In [ ]:
titanic.pivot_table('survived', ['sex', 'age_cat'])

                survived
sex    age_cat
female 미성년자     0.671233
       청년       0.723881
       중년       0.779070
       장년       0.941176
male   미성년자     0.228261
       청년       0.142857
       중년       0.225806
       장년       0.119048
       노년       0.200000

## e

In [ ]:
titanic['age_group'] = pd.qcut(titanic.age, 3, labels=['A1', 'A2', 'A3'])
titanic.tail()

     survived  pclass     sex        age  ...  alone  category1  age_cat age_group
886         0       2    male  27.000000  ...   True       male       청년        A2
887         1       1  female  19.000000  ...   True      child     미성년자        A1
888         0       3  female  29.699118  ...  False     female       청년        A2
889         1       1    male  26.000000  ...   True       male       청년        A2
890         0       3    male  32.000000  ...   True       male       중년        A3

[5 rows x 18 columns]

In [ ]:
titanic.pivot_table('survived', 'age_group')

           survived
age_group
A1         0.411960
A2         0.335526
A3         0.405594

In [ ]:
# 남 녀 성비 / 남자 : 1, 여자 : 0
titanic['gender'] = titanic.apply(lambda r: 1 if r.sex == 'male' else 0, axis=1)
titanic.tail()

     survived  pclass     sex        age  ...  category1  age_cat  age_group gender
886         0       2    male  27.000000  ...       male       청년         A2      1
887         1       1  female  19.000000  ...      child     미성년자         A1      0
888         0       3  female  29.699118  ...     female       청년         A2      0
889         1       1    male  26.000000  ...       male       청년         A2      1
890         0       3    male  32.000000  ...       male       중년         A3      1

[5 rows x 19 columns]

In [ ]:
titanic.pivot_table('gender', 'age_group')

             gender
age_group
A1         0.594684
A2         0.680921
A3         0.667832

In [ ]:
titanic.pivot_table(['gender', 'survived'], 'age_group')

             gender  survived
age_group
A1         0.594684  0.411960
A2         0.680921  0.335526
A3         0.667832  0.405594

# Q3

## 1

In [ ]:
 mpg = sns.load_dataset('mpg')
 mpg

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

In [ ]:
mpg['hp_per_cc'] = mpg['horsepower'] / mpg['displacement']
mpg

      mpg  cylinders  ...                       name  hp_per_cc
0    18.0          8  ...  chevrolet chevelle malibu   0.423453
1    15.0          8  ...          buick skylark 320   0.471429
2    18.0          8  ...         plymouth satellite   0.471698
3    16.0          8  ...              amc rebel sst   0.493421
4    17.0          8  ...                ford torino   0.463576
..    ...        ...  ...                        ...        ...
393  27.0          4  ...            ford mustang gl   0.614286
394  44.0          4  ...                  vw pickup   0.536082
395  32.0          4  ...              dodge rampage   0.622222
396  28.0          4  ...                ford ranger   0.658333
397  31.0          4  ...                 chevy s-10   0.689076

[398 rows x 10 columns]

## 2

In [ ]:
mpg['manufacturer'] = mpg.name.apply(lambda x: x.split()[0])
mpg['model'] = mpg.name.apply(lambda x: ''.join(x.split()[1:]))
mpg

      mpg  cylinders  displacement  ...  hp_per_cc  manufacturer           model
0    18.0          8         307.0  ...   0.423453     chevrolet  chevellemalibu
1    15.0          8         350.0  ...   0.471429         buick      skylark320
2    18.0          8         318.0  ...   0.471698      plymouth       satellite
3    16.0          8         304.0  ...   0.493421           amc        rebelsst
4    17.0          8         302.0  ...   0.463576          ford          torino
..    ...        ...           ...  ...        ...           ...             ...
393  27.0          4         140.0  ...   0.614286          ford       mustanggl
394  44.0          4          97.0  ...   0.536082            vw          pickup
395  32.0          4         135.0  ...   0.622222         dodge         rampage
396  28.0          4         120.0  ...   0.658333          ford          ranger
397  31.0          4         119.0  ...   0.689076         chevy            s-10

[398 rows x 12 columns]

In [ ]:
del mpg['name']
mpg

      mpg  cylinders  displacement  ...  hp_per_cc  manufacturer           model
0    18.0          8         307.0  ...   0.423453     chevrolet  chevellemalibu
1    15.0          8         350.0  ...   0.471429         buick      skylark320
2    18.0          8         318.0  ...   0.471698      plymouth       satellite
3    16.0          8         304.0  ...   0.493421           amc        rebelsst
4    17.0          8         302.0  ...   0.463576          ford          torino
..    ...        ...           ...  ...        ...           ...             ...
393  27.0          4         140.0  ...   0.614286          ford       mustanggl
394  44.0          4          97.0  ...   0.536082            vw          pickup
395  32.0          4         135.0  ...   0.622222         dodge         rampage
396  28.0          4         120.0  ...   0.658333          ford          ranger
397  31.0          4         119.0  ...   0.689076         chevy            s-10

[398 rows x 11 columns]

## 3

In [ ]:
mpg.pivot_table('mpg', 'cylinders')

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

## 4

In [ ]:
mpg.pivot_table('hp_per_cc', 'origin')

        hp_per_cc
origin
europe   0.740005
japan    0.789485
usa      0.512063

## 5

In [ ]:
mpg.groupby('manufacturer').model.value_counts()

manufacturer  model
amc           matador            5
              gremlin            4
              hornet             4
              concord            2
              matador(sw)        2
                                ..
vw            rabbit             2
              dasher(diesel)     1
              pickup             1
              rabbitc(diesel)    1
              rabbitcustom       1
Name: model, Length: 304, dtype: int64

In [ ]:
# mpg[mpg.groupby('manufacturer').model.nunique() >= 5]

IndexingError: ignored

In [ ]:
mpg